#+title: Nico’s SICP notes

These are the notes for the second edition, which is authored by by
Harold Abelson and Gerald Jay Sussman, with Julie Sussman


**** Expressions
[[info:sicp#1-1-1]]

- [[expression]] (in glossary)

- An expression is an statement/description that can be evaluated, ie,
  reduced to a single value.

- There are <<primitive expressions>> :

  - Eg, those representing numbers: for integers, the numbers typed as
    themselves, evaluate to those numbers:

    #+begin_src scheme
      27
    #+end_src

    #+RESULTS:
    : 27

  - Or e.g., those representing procedures, such as the add procedure
    ‘+’ which is a primitive procedure.

    #+begin_src scheme
      +
    #+end_src

    #+RESULTS:
    : #<procedure + (#:optional _ _ . _)>

- And there are <<compound expressions>> :

  - Representing procedure application.  For example, add
    ‘+’ can be combined with number expressions to represent the
    adding application, ie, sum:

    #+begin_src scheme
      (+ 1 2 3 4 5)
    #+end_src

    #+RESULTS:
    : 15

  - This type of compound expression representing procedure
    application will be called a /combination/.  In a combination, the
    first element is the operator and the rest are the operands.

    Putting the operator first and the arguments later is called
    [[prefix notation]].

    :personal-note:
    I guess its called combination as in, combination of expressions.
    The combination in itself its also an expression, because it
    evaluates, it produces a value.  Simple ideas get combined to
    represent a complex idea.  The framework for thinking about
    processes: define simple ideas, define a way to combine them,
    create complex ideas through the combinations.
    :end:

  - Prefix notation has the following advantages in regarding to
    procedure application: <<prefix-notation-advantages>>

    - Being able to accomodate an arbitrary number of arguments.

      - infix sum, always takes two args: ~1 + 2~, that is,
        ~left + right~

      - prefix sum can take any: ~+ 1 2 3 4 5 ... n~

      This applies for any operation.

    - Easier evaluation model, due to uniformity

      #+begin_quote
      A second advantage of prefix notation is that it extends in a
      straightforward way to allow combinations to be nested, that is,
      to have combinations whose elements are themselves combinations
      #+end_quote

      In programming languages with infix notation, we require to know
      the arity of each operation, and we need parenthesis to override
      the natural order of each operation.  For example:

      #+begin_src python
        return 1 + 2 * 3 - 1 / 2
      #+end_src

      #+RESULTS:
      : 6.5

      To evaluate this we would nee to follow the general rules of
      math, that is, first multiply and divide in the order of
      appareance, then add and substract in order of appearance.  This
      gets more complicated with larger expressions, with each
      operator having it’s own precedence rules.

      In lisp, due to the delimited procedures, the use of prefix
      notation creates a simple and straightforward evaluation model,
      that is uniform and unambiguos:

      #+begin_src scheme
        (- (+ 1
              (* 2 3))
           (/ 1 2))
      #+end_src

      #+RESULTS:
      : 13/2

      We don’t need to know arity, we just follow recursively the same
      evaluation rules, i.e., first element is procedure, rest are
      arguments.  We can evaluate each sub expression at a time
      without problems.

- The interpreter works by evaluating expressions one and a time, and
  printing their results.  That is why it’s said that it works in a
  ‘read-eval-print’ loop, also know as ‘repl’


**** Naming and the Environment
[[info:sicp#1-1-2]]

- Languages allow to /refer/ to computational objects *by name*.

- A name identifies a "variable" whose "value" *is* the computational
  object:

  : name -> variable -> value

  By the name we identify and refer to the variable, which holds the
  computational object.

  :personal-note:
  It’s worth noting that just as in real life, the word is not the thing
  (the word "dog" is not the dog), it’s just used to refer to it.
  Thats why the name can also be called a symbol; as in, symbols
  refers to things, as in, the symbol "dog" refers to a dog.
  :end:

- We should ask ourselves, what means do any specific language
  provides for naming computational objects.

  In scheme we use ‘define’:

  #+begin_src scheme
    ; use ‘define’ for naming the object ‘2’ with the name ‘size’
    (define size 2)
    ; use the name ‘size’ to reffer to the object ‘2’
    size ;; => 2
  #+end_src

  #+RESULTS:
  : 2

  From now on we can refer to this object (number two) by the name
  ‘size’.

- Naming is one of our means of /abstraction/.  We don’t need to
  replicate all the details of complex computational objects each time
  we want to use them; we just refer to them by name.

- The ability to associate a symbol with a value, and later retrieve
  that value by the symbol name, means that the interpreter must keep
  track of those name-value associations in some kind of memory.  This
  "memory" is called an [[environment]], and there can be many environments.


